Revit 2027 API
FailureMessageAccessor.GetDefaultResolutionCaption Method
 Retrieves the caption of default resolution of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetDefaultResolutionCaption()
Public Function GetDefaultResolutionCaption As String
public:
String^ GetDefaultResolutionCaption()
member GetDefaultResolutionCaption : unit -> string
Return Value
String
 The caption of default resolution of the failure.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace